//=================================================================================
//|                                                                               |
//|  RTSEngine                                                                    |
//|  Экранная точка                                                               |
//|  Небольшая структура для хранения                                             |
//|  координат отрисовки в float.                                                 |
//|                                                                               |
//=================================================================================
#pragma once

struct ScreenPoint {
    float x;
    float y;
};
